#include "delay.h"
#include "beep.h"	

/**************************************************************************************
功能描述：对PWM2（P3.7引脚）进行初始化
入口参数：无
返回值：无
 **************************************************************************************/
void PWM2_P37_Configuration(void)
{
	PWMCFG &= 0xBF;		         //将CBTADC位置0，即PWM计数器归零时不触发ADC转换
	PWMIF &= 0xBF;		         //将CBIF位置0，PWM计数器归零中断标志位，需软件清零
	
	P_SW2 |= 0x80;		         //将EAXSFR位置1，以访问PWM在扩展RAM区的特殊功能寄存器
	//对PWM2的初始化部分
	PWM2CR &= 0xF7;	           //将PWM2_PS位置0，选择PWM2的输出引脚是P3.7
	PWMCR |= 0x01;		         //将ENC2O位置1，PWM2的端口为PWM输出口，受PWM波形发生器控制	
	PWMCFG &= 0xFE;		         //将C2INI位置0，设置PWM2输出端口的初始电平为低电平
	PWMIF &= 0xFE;		         //将C2IF位置0，PWM2中断标志位，需软件清零
	PWM2CR |= 0x04;	           //将EPWM2I位置1，使能PWM2中断
	PWM2CR &= 0xFD;	           //将EC2T2SI位置0，关闭T2翻转时中断
	PWM2CR &= 0xFE;	           //将EC2T1SI位置0，关闭T1翻转时中断
	//对PWM2和PWM3翻转计数器赋初值
	PWM2T1 = 0x007D;           //赋值PWM2第一次翻转计数器值
	PWM2T2 = 0x00FA;           //赋值PWM2第二次翻转计数器值
	
  //对PWM波形发生器时钟源进行初始化
	PWMCKS |= 0x10;		         //将SELT2位置1，PWM时钟源为定时器2溢出脉冲
	PWMC = 0x00FA;             //PWM计数器赋值（同时对PWMCH和PWMCL进行了赋值）
	AUXR |= 0x04;		           //定时器2时钟为Fosc,即1T
	T2L = 0xE0;		             //设定定时初值
	T2H = 0xFE;                //设定定时初值
	AUXR |= 0x10;              //启动定时器2
	P_SW2 &= 0x7F;		         //将EAXSFR位置0，恢复访问XRAM
	
	//PWM外部异常控制寄存器的操作
	PWMFDCR &= 0xDF;		       //将ENFD位置0，关闭PWM外部异常检测功能
	PWMFDCR &= 0xF7;		       //将ENDI位置0，关闭PWM异常检测中断
	PWMFDCR &= 0xFB;		       //将FDCMP位置0，比较器与PWM无关
	PWMFDCR &= 0xFD;		       //将FDIO位置0，P2.4的状态与PWM无关
	PWMFDCR &= 0xFE;		       //将FDIF位置0，PWM异常检测中断标志位，需软件清零
	
	IP2 |= 0x40;		           //将PPWM位置1，使能PWM中断为最高优先级中断
	//使能PWM波形发生器
	PWMCR |= 0x80;		         //将ENPWM位置1，使能PWM波形发生器，PWM计数器开始计数
	PWMCR &= 0xBF;		         //将ECBI位置0，禁止PWM计数器归零中断
}

/***************************************************************************
 * 描  述 : 开启蜂鸣器
 * 入  参 : 无
 * 返回值 : 无
 **************************************************************************/
void	BEEP_on(void)
{
		PWM2_P37_Configuration();
	  EA = 1;		                  //允许总中断
}

/***************************************************************************
 * 描  述 : 关闭蜂鸣器
 * 入  参 : 无
 * 返回值 : 无
 **************************************************************************/
void	BEEP_off(void)
{
	  EA = 0;		                 //关闭总中断
	  PWMCR &= 0x7F;		         //将ENPWM位置0，禁止PWM波形发生器，PWM计数器停止计数
}

/***************************************************************************
 * 描  述 : PWM中断服务函数
 * 入  参 : 无
 * 返回值 : 无
 **************************************************************************/
void PWM(void) interrupt PWM_VECTOR using 1
{
	PWMIF &= 0xBF;		         //将CBIF位置0，PWM计数器归零中断标志位，需软件清零
	PWMIF &= 0xFE;		         //将C2IF位置0，PWM2中断标志位，需软件清零
	PWMIF &= 0xFD;		         //将C3IF位置0，PWM3中断标志位，需软件清零
}

/*********************************END FILE********************************************/	

